sdaiRenameModel(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Renames the model.
\param model     [in] A model to be renamed.
\param modelName [in] A string that contains the new model name.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiTR_NEXS - Transaction does not exist.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMO_DUP - SDAI-model duplicate.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "ModelName", "ifc4");
...
sdaiRenameModel(model, "Model1");